from pathlib import Path

from pecha_org_categorizer.extract import CategoryExtractor, extract_text_details


def test_extract_category():
    DATA_DIR = Path(__file__).parent / "data"
    input_xlsx = DATA_DIR / "input.xlsx"

    extractor = CategoryExtractor()
    extracted_info = extractor.extract_categories(input_xlsx)
    assert extracted_info == [
        ["ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)"],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "ཀུན་བཟང་སྨོན་ལམ།(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་)(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "ཀུན་བཟང་སྨོན་ལམ།(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་)(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "རྩ་བ།",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "ཀུན་བཟང་སྨོན་ལམ།(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་)(ཀུན་བཟང་སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "འགྲེལ་བ།",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "བཟང་སྤྱོད་སྨོན་ལམ།(བཟང་སྤྱོད་འགྲེལ་བཤད་)(བཟང་སྤྱོད་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "བཟང་སྤྱོད་སྨོན་ལམ།(བཟང་སྤྱོད་འགྲེལ་བཤད་)(བཟང་སྤྱོད་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "རྩ་བ།",
        ],
        [
            "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "བཟང་སྤྱོད་སྨོན་ལམ།(བཟང་སྤྱོད་འགྲེལ་བཤད་)(བཟང་སྤྱོད་འགྲེལ་བཤད་ཐུང་ཐུང་)",
            "འགྲེལ་བ།",
        ],
    ]


def parse_category():
    text = "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)"
    name, desc, short_desc = extract_text_details(text)

    assert name == "ཁ་འདོན།"
    assert desc == "ཁ་འདོན་འགྲེལ་བཤད་"
    assert short_desc == "ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་"

    text = "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)"
    name, desc, short_desc = extract_text_details(text)
    assert name == "སྨོན་ལམ།"
    assert desc == "སྨོན་ལམ་འགྲེལ་བཤད་"
    assert short_desc == ""

    text = "བཟང་སྤྱོད་སྨོན་ལམ།"
    name, desc, short_desc = extract_text_details(text)
    assert name == "བཟང་སྤྱོད་སྨོན་ལམ།"
    assert desc == ""
    assert short_desc == ""


def test_format_category():
    extractor = CategoryExtractor()

    input = ["ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་)"]
    output = extractor.format_categories(input)
    assert output == [
        {
            "name": "ཁ་འདོན།",
            "desc": "ཁ་འདོན་འགྲེལ་བཤད་",
            "short_desc": "ཁ་འདོན་འགྲེལ་བཤད་",
        }
    ]

    input = ["སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)"]
    output = extractor.format_categories(input)
    assert output == [
        {"name": "སྨོན་ལམ།", "desc": "སྨོན་ལམ་འགྲེལ་བཤད་", "short_desc": ""}
    ]

    input = ["བཟང་སྤྱོད་སྨོན་ལམ།"]
    output = extractor.format_categories(input)
    assert output == [{"name": "བཟང་སྤྱོད་སྨོན་ལམ།", "desc": "", "short_desc": ""}]

    input = [
        "ཁ་འདོན།(ཁ་འདོན་འགྲེལ་བཤད་)(ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        "སྨོན་ལམ།(སྨོན་ལམ་འགྲེལ་བཤད་)(སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        "བཟང་སྤྱོད་སྨོན་ལམ།(བཟང་སྤྱོད་འགྲེལ་བཤད་)(བཟང་སྤྱོད་འགྲེལ་བཤད་ཐུང་ཐུང་)",
        "འགྲེལ་བ།",
    ]
    output = extractor.format_categories(input)
    assert output == [
        {
            "name": "ཁ་འདོན།",
            "desc": "ཁ་འདོན་འགྲེལ་བཤད་",
            "short_desc": "ཁ་འདོན་འགྲེལ་བཤད་ཐུང་ཐུང་",
        },
        {
            "name": "སྨོན་ལམ།",
            "desc": "སྨོན་ལམ་འགྲེལ་བཤད་",
            "short_desc": "སྨོན་ལམ་འགྲེལ་བཤད་ཐུང་ཐུང་",
        },
        {
            "name": "བཟང་སྤྱོད་སྨོན་ལམ།",
            "desc": "བཟང་སྤྱོད་འགྲེལ་བཤད་",
            "short_desc": "བཟང་སྤྱོད་འགྲེལ་བཤད་ཐུང་ཐུང་",
        },
        {"name": "འགྲེལ་བ།", "desc": "", "short_desc": ""},
    ]


test_format_category()
